In [66]:
import numpy as np  
import pandas as pd 

#LOAD DATA CSV FILE
df_order=pd.read_csv('datasets/client_zoocsv.csv', header=0)
df_order

,id,first_name,last_name,location,cat,dog,other,order,company_order,frequency
0,1,Ellissa,Snoddy,Czech Republic,False,False,True,"€990,68",Colgate-Palmolive Company,year
1,2,Noak,De Ambrosi,Poland,NaN,NaN,NaN,NaN,NaN,quarter
2,3,Marlo,Derham,Poland,True,True,True,"€32,01",TOP CARE (Topco Associates LLC),week
3,4,Carroll,Clarke-Williams,Czech Republic,False,True,True,"€243,15",Teva Pharmaceuticals USA Inc,week
4,5,Joy,Camden,Poland,False,True,True,"€149,16",Eli Lilly and Company,week
...,...,...,...,...,...,...,...,...,...,...
495,496,Hildegarde,Boldero,NaN,True,False,False,"€926,62",Meijer Distribution Inc,month
496,497,Anna-diane,Easton,Poland,False,True,False,"€912,65",Sandoz Inc,quarter
497,498,Kathie,Rushmare,Poland,True,True,True,"€164,67",Ventura Corporation LTD.,week
498,499,Maia,Dudeney,Poland,False,True,True,"€870,31",Rebel Distributors Corp,month
499,500,Rafaelia,Antonikov,Czech Republic,NaN,NaN,NaN,NaN,NaN,month

In [67]:
#PREPARING DATA
#cleaning data > fill or drop NaN Nulls
#types > int /float 

df_order.dtypes

id                int64
first_name       object
last_name        object
location         object
cat              object
dog              object
other            object
order            object
company_order    object
frequency        object
dtype: object

In [80]:
#change type object/str >> float column - order 

df_order.order=df_order.order.str.replace(',' , '.').astype(float)
df_order.order

0      990.68
1        0.00
2       32.01
3      243.15
4      149.16
        ...
495    926.62
496    912.65
497    164.67
498    870.31
499      0.00
Name: order, Length: 500, dtype: float64

In [81]:
df_order

,id,first_name,last_name,location,cat,dog,other,order,company_order,frequency
0,1,Ellissa,Snoddy,Czech Republic,False,False,True,990.68,Colgate-Palmolive Company,year
1,2,Noak,De Ambrosi,Poland,NaN,NaN,NaN,0.00,NaN,quarter
2,3,Marlo,Derham,Poland,True,True,True,32.01,TOP CARE (Topco Associates LLC),week
3,4,Carroll,Clarke-Williams,Czech Republic,False,True,True,243.15,Teva Pharmaceuticals USA Inc,week
4,5,Joy,Camden,Poland,False,True,True,149.16,Eli Lilly and Company,week
...,...,...,...,...,...,...,...,...,...,...
495,496,Hildegarde,Boldero,NaN,True,False,False,926.62,Meijer Distribution Inc,month
496,497,Anna-diane,Easton,Poland,False,True,False,912.65,Sandoz Inc,quarter
497,498,Kathie,Rushmare,Poland,True,True,True,164.67,Ventura Corporation LTD.,week
498,499,Maia,Dudeney,Poland,False,True,True,870.31,Rebel Distributors Corp,month
499,500,Rafaelia,Antonikov,Czech Republic,NaN,NaN,NaN,0.00,NaN,month

In [5]:
#PREPARING DATA/cleaning data 
#>>removing outliners  Standrad deviation IQR METODY

#Standrad Deviation